12/data/attachments/77bc8c08e4acfb38.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Amanda_protect_Friend_27071_5</nif:username>
            <nif:friendToBeRequested>soap_friends_7517b9fd-d6d3-4a46-9355-acf0c1718140</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>